const regs = {
    phone: /^1[3-9]\d{9}$/,
    /*
        ^表示开始，在[]中的第一个位置表示非区间字符
		$表示结尾
        
		必须同时包含：
            数字(?=.*\d)
            小写字母(?=.*[a-z])
            大写字母(?=.*[A-Z])
		
		[\da-zA-Z]{6,20}表示任意6-20位的数字、字母组合
        
     */
    password: /^(?=.*\d)(?=.*[a-zA-Z])[\da-zA-Z]{6,20}$/,
    code: /^\d{4,6}$/, // 短信验证码
    name: /^[\u4e00-\u9fa5]{2,}$/, // 中文姓名
    // 身份证
    id: /^(([1-6][1-9]|50)\d{4}(18|19|20)\d{2}((0[1-9])|10|11|12)(([0-2][1-9])|10|20|30|31)\d{3}[\dXx]|([1-6][1-9]|50)\d{4}\d{2}((0[1-9])|10|11|12)(([0-2][1-9])|10|20|30|31)\d{3})$/,

    replace: {
        thChar: /\B(?=(\d{3})+\b)/g
    }
}

export default regs;